practicals/ps7/karman-RAS/0/tracer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      tracer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform 0;
        name            codedPatchBC;
        code            #{
            const fvPatch& patch = this->patch();
            const vectorField& cf = patch.Cf();
            
            scalarField& field = *this;
            forAll(cf, i)
            {
                field[i] = (cf[i].y() <= 0.5) ? 1. : 0.;
            }

        #};
    }
    outlet
    {
        type            zeroGradient;
    }
    topAndBottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    cylinder
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
