practicals/ps7/karman-RAS/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

points  ( (1 0.5 0.0125) );

fields  (tracer);

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

// ************************************************************************* //
